# İleri Operasyonlar

In [3]:
import pandas as pd
import numpy as np

In [4]:
maasSozluk = {
    "Isim" : ["Atıl", "Zeynep", "Mehmet", "Ahmet"],
    "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
    "Maaş" : [200, 300, 400, 500]
}

In [6]:
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

     Isim  Departman  Maaş
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [7]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [9]:
maasDataFrame["Departman"].unique()  # aynı olan değerleri getirmedi

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [11]:
maasDataFrame["Departman"].nunique() # farklı olan değerlerin sayısını getirir

3

In [13]:
maasDataFrame["Departman"].value_counts()  #hangi faktörden kaç tane olduğunu getirir

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [17]:
def bruttenNete(maas):
    return maas * 0.66

In [19]:
maasDataFrame["Maaş"].apply(bruttenNete) #fonksiyon uygulandı

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maaş, dtype: float64

In [23]:
maasDataFrame.isnull() #boş değer var mı

    Isim  Departman   Maaş
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## yeni örnek

In [30]:
yeniBirVeri = {
    "Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
    "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
    "Karakter Yaş" : [9, 10, 50, 20, 10]
}

In [31]:
karakterDF = pd.DataFrame(yeniBirVeri)
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yaş
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [34]:
karakterDF.pivot_table(values="Karakter Yaş", index=["Karakter Sınıfı", "Karakter Ismi"], aggfunc=np.sum) 
#aggfunc=sum aynı karakter ismindeki kişilerin yaşını topluyor, hiçbir şey yazılmasaydı ortalama alacaktı

                               Karakter Yaş
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10